Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.GetBindPropertyName Method
 Retrieves the BindPropertyName text associated with the specified control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GetBindPropertyName(
	Control control
)
Public Function GetBindPropertyName (
	control As Control
) As String
Parameters
control
Type: System.Windows.Forms.Control
The control for which to retrieve the BindPropertyName text.
Return Value
Type: String
 A string containing the BindPropertyName text for the specified control, or null if no text is associated with the specified control.
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace